//
//  Sources.swift
//  AlgorithmXTests
//
//  Created by 黄文飞 on 2021/1/17.
//  Copyright © 2021 黄文飞. All rights reserved.
//

import Foundation

public struct Sources {
    
    public typealias Source = [[AnyHashable]]
    
    public static let bfs01: Source = [
        ["a", "b"], ["a", "f"],
        ["b", "c"], ["b", "i"], ["b", "g"],
        ["c", "i"], ["c", "d"],
        ["d", "i"], ["d", "g"], ["d", "e"], ["d", "h"],
        ["e", "h"], ["e", "f"],
        ["f", "g"],
        ["g", "h"]
    ]
    
    public static let bfs02: Source = [
        [0, 1], [0, 4],
        [1, 2],
        [2, 0], [2, 4], [2, 5],
        [3, 1],
        [4, 6], [4, 7],
        [5, 3], [5, 7],
        [6, 2], [6, 7]
    ]
    
    public static let bfs03: Source = [
        [0, 2], [0, 3],
        [1, 2], [1, 3], [1, 6],
        [2, 4],
        [3, 7],
        [4, 6],
        [5, 6],
        [6, 7]
    ]
    
    public static let bfs04: Source = [
        [1, 2], [1, 3], [1, 5],
        [2, 0],
        [3, 5],
        [5, 6], [5, 7],
        [6, 2],
        [7, 6]
    ]
    
    public static let dfs01: Source = [
        [0, 1],
        [1, 3], [1, 5], [1, 6], [1, 2],
        [2, 4],
        [3, 7]
    ]
    
    public static let dfs02: Source = [
        ["a", "b"], ["a", "e"],
        ["b", "e"],
        ["c", "b"],
        ["d", "a"],
        ["e", "c"], ["e", "f"],
        ["f", "c"]
    ]
    
    public static let topo: Source = [
        [0, 2],
        [1, 0],
        [2, 5], [2, 6],
        [3, 1], [3, 5], [3, 7],
        [5, 7],
        [6, 4],
        [7, 6]
    ]
    
    public static let noWeight2: Source = [
        [0, 3],
        [1, 3], [1, 6],
        [2, 1],
        [3, 5],
        [6, 2], [6, 5],
        [4, 7]
    ]
    
    public static let noWeight3: Source = [
        [0, 1], [0, 2],
        [1, 2], [1, 5],
        [2, 4], [2, 5],
        [5, 6], [7, 6],
        [3]
    ]
    
    public static let mst01: Source = [
        [0, 2, 2], [0, 4, 7],
        [1, 2, 3], [1, 5, 1], [1, 6, 7],
        [2, 4, 4], [2, 5, 3], [2, 6, 6],
        [3, 7, 9],
        [4, 6, 8],
        [5, 6, 4], [5, 7, 5]
    ]
    
    public static let mst02: Source = [
        ["a", "b", 17], ["a", "f", 1], ["a", "e", 16],
        ["b", "c", 6], ["b", "d", 5], ["b", "f", 11],
        ["c", "d", 10],
        ["d", "e", 4], ["d", "f", 14],
        ["e", "f", 33]
    ]
    
    public static let weight3: Source = [
        ["广州", "佛山", 100], ["广州", "珠海", 200], ["广州", "肇庆", 200],
        ["佛山", "珠海", 50], ["佛山", "深圳", 150],
        ["肇庆", "珠海", 100], ["肇庆", "南宁", 150],
        ["珠海", "南宁", 350], ["珠海", "深圳", 100],
        ["南宁", "香港", 500], ["南宁", "深圳", 400],
        ["深圳", "香港", 150]
    ]
    
    public static let sp: Source = [
        ["a", "b", 10], ["a", "d", 30], ["a", "e", 100],
        ["b", "c", 50],
        ["c", "e", 10],
        ["d", "c", 20], ["d", "e", 60]
    ]
    
    public static let sp1: Source = [
        ["a", "f", 100], ["a", "e", 30], ["a", "c", 10],
        ["b", "c", 5],
        ["c", "d", 50],
        ["d", "f", 10],
        ["e", "f", 60], ["e", "d", 20]
    ]
    
    public static let bfSp: Source = [
        ["a", "b", 10], ["a", "e", 8],
        ["b", "c", 8], ["b", "e", -5],
        ["d", "c", 2], ["d", "f", 6],
        ["e", "d", 7], ["e", "f", 3]
    ]
    
    public static let weight5: Source = [
        [0, 14, 1], [0, 4, 8],
        [1, 2, 9],
        [2, 3, 6], [2, 5, 9],
        [3, 17, 1], [3, 10, 4],
        [4, 5, 2], [4, 8, 2],
        [5, 6, 6], [5, 8, 1], [5, 9, 4],
        [6, 9, 8],
        [7, 11, 4],
        [8, 9, 1], [8, 11, 2], [8, 12, 7],
        [9, 10, 7], [9, 13, 4],
        [10, 13, 2],
        [11, 12, 7], [11, 15, 4],
        [12, 13, 2], [12, 16, 2],
        [13, 16, 7],
        [15, 16, 7], [15, 17, 7],
        [16, 17, 2]
    ]
    
    public static let negativeWeight1: Source = [
        ["a", "b", -1], ["a", "c", 4],
        ["b", "c", 3], ["b", "d", 2], ["b", "e", 2],
        ["d", "b", 1], ["d", "c", 5],
        ["e", "d", -3]
    ]
    
    /**
     * 有负权环
     */
    public static let negativeWeight2: Source = [
        [0, 1, 1],
        [1, 2, 7],
        [1, 0, -2]
    ]
    
}
